<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7adde28626fe4f8167ce22197e170d8f66fdb3bb228ea66764a961485f1b7f6f","plan_job_ref":"Job Plan Airflow DAGs #194 at https://github.com/cal-itp/data-infra/actions/runs/16152643185","plan_out_hash":"139a0e085012df46b7dc439c0f4eaa791f8f46e814f5d2eddc2e9233b68f38e8","plan_hash":"e0babc1f20bba1450820e119ad5086637c8f7b25536b3e208c193dcaf064786a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/ntd_report_from_blackcat/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LzvAJQ==" -> (known after apply)
!~      detect_md5hash      = "bYWhiTq81iqyi3JOKtCapg==" -> "different hash"
!~      generation          = 1751416674880572 -> (known after apply)
        id                  = "calitp-composer-dags/ntd_report_from_blackcat/METADATA.yml"
!~      md5hash             = "bYWhiTq81iqyi3JOKtCapg==" -> (known after apply)
        name                = "dags/ntd_report_from_blackcat/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/ntd_report_from_blackcat/all_submitted_for_ntd.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "FvFWLg==" -> (known after apply)
!~      detect_md5hash      = "V57VXnOBjdn8FSQ+05I/AQ==" -> "different hash"
!~      generation          = 1751416671887614 -> (known after apply)
        id                  = "calitp-composer-dags/ntd_report_from_blackcat/all_submitted_for_ntd.yml"
!~      md5hash             = "V57VXnOBjdn8FSQ+05I/AQ==" -> (known after apply)
        name                = "dags/ntd_report_from_blackcat/all_submitted_for_ntd.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/__init__.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "AmlBDQ==" -> (known after apply)
!~      detect_md5hash      = "9KAZgWD05cLRCq9nZqhElg==" -> "different hash"
!~      generation          = 1751997663052285 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/__init__.py"
!~      md5hash             = "9KAZgWD05cLRCq9nZqhElg==" -> (known after apply)
        name                = "plugins/operators/__init__.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/blackcat_to_gcs.py"] will be destroyed
  # (because key ["plugins/operators/blackcat_to_gcs.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "s/gNaA==" -> null
-       detect_md5hash      = "jwAkd/uIgdf2P+66T76Vwg==" -> null
-       event_based_hold    = false -> null
-       generation          = 1751416675267640 -> null
-       id                  = "calitp-composer-plugins/operators/blackcat_to_gcs.py" -> null
-       md5hash             = "jwAkd/uIgdf2P+66T76Vwg==" -> null
-       md5hexhash          = "8f002477fb8881d7f63feeba4fbe95c2" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/plugins%2Foperators%2Fblackcat_to_gcs.py?generation=1751416675267640&alt=media" -> null
-       metadata            = {} -> null
-       name                = "plugins/operators/blackcat_to_gcs.py" -> null
-       output_name         = "plugins/operators/blackcat_to_gcs.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/plugins%2Foperators%2Fblackcat_to_gcs.py" -> null
-       source              = "../../../../airflow/plugins/operators/blackcat_to_gcs.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/blackcat_to_gcs_operator.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/operators/blackcat_to_gcs_operator.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/operators/blackcat_to_gcs_operator.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = "application/vnd.msgpack"
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

Plan: 2 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #194](https://github.com/cal-itp/data-infra/actions/runs/16152643185)